
## Plan Result




### :warning: Resource Deletion will happen :warning:
This plan contains resource delete operation. Please check the plan result very carefully!

<pre><code>Plan: 4 to add, 0 to change, 3 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.redis6_connection_string
  * module.redis6-cache.azurerm_private_endpoint.this[0]
  * module.redis6-cache.azurerm_redis_cache.redis
  * module.redis6-cache.azurerm_resource_group.cache-resourcegroup[0]
* Delete
  * azurerm_key_vault_secret.redis_connection_string
  * module.redis-cache.azurerm_redis_cache.redis
  * module.redis-cache.azurerm_resource_group.cache-resourcegroup[0]


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.redis6_connection_string will be created
  + resource "azurerm_key_vault_secret" "redis6_connection_string" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-aat/providers/Microsoft.KeyVault/vaults/rpx-aat"
      + name                    = "ao-webapp-redis6-connection-string"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

  # azurerm_key_vault_secret.redis_connection_string will be destroyed
  # (because azurerm_key_vault_secret.redis_connection_string is not in configuration)
  - resource "azurerm_key_vault_secret" "redis_connection_string" {
      - content_type            = "" -> null
      - id                      = "https://rpx-aat.vault.azure.net/secrets/ao-webapp-redis-connection-string/ccc785ed9830459495ded68486b584eb" -> null
      - key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-aat/providers/Microsoft.KeyVault/vaults/rpx-aat" -> null
      - name                    = "ao-webapp-redis-connection-string" -> null
      - resource_id             = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-aat/providers/Microsoft.KeyVault/vaults/rpx-aat/secrets/ao-webapp-redis-connection-string/versions/ccc785ed9830459495ded68486b584eb" -> null
      - resource_versionless_id = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-aat/providers/Microsoft.KeyVault/vaults/rpx-aat/secrets/ao-webapp-redis-connection-string" -> null
      - tags                    = {} -> null
      - value                   = (sensitive value)
      - version                 = "ccc785ed9830459495ded68486b584eb" -> null
      - versionless_id          = "https://rpx-aat.vault.azure.net/secrets/ao-webapp-redis-connection-string" -> null

      - timeouts {}
    }

  # module.redis-cache.azurerm_redis_cache.redis will be destroyed
  # (because azurerm_redis_cache.redis is not in configuration)
  - resource "azurerm_redis_cache" "redis" {
      - capacity                      = 1 -> null
      - enable_non_ssl_port           = false -> null
      - family                        = "P" -> null
      - hostname                      = "rpx-ao-redis-aat.redis.cache.windows.net" -> null
      - id                            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-ao-redis-cache-aat/providers/Microsoft.Cache/Redis/rpx-ao-redis-aat" -> null
      - location                      = "uksouth" -> null
      - minimum_tls_version           = "1.2" -> null
      - name                          = "rpx-ao-redis-aat" -> null
      - port                          = 6379 -> null
      - primary_access_key            = (sensitive value)
      - primary_connection_string     = (sensitive value)
      - private_static_ip_address     = "10.96.135.147" -> null
      - public_network_access_enabled = true -> null
      - redis_version                 = "4.0.14" -> null
      - replicas_per_master           = 0 -> null
      - replicas_per_primary          = 0 -> null
      - resource_group_name           = "rpx-ao-redis-cache-aat" -> null
      - secondary_access_key          = (sensitive value)
      - secondary_connection_string   = (sensitive value)
      - shard_count                   = 0 -> null
      - sku_name                      = "Premium" -> null
      - ssl_port                      = 6380 -> null
      - subnet_id                     = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-1-aat" -> null
      - tags                          = {
          - "BuiltFrom"           = "https://github.com/HMCTS/rpx-xui-approve-org.git"
          - "application"         = "expert-ui"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#xui-pipeline"
          - "environment"         = "staging"
          - "managedBy"           = "Expert UI"
        } -> null
      - tenant_settings               = {} -> null
      - zones                         = [] -> null

      - redis_configuration {
          - aof_backup_enabled              = false -> null
          - enable_authentication           = true -> null
          - maxclients                      = 7500 -> null
          - maxfragmentationmemory_reserved = 642 -> null
          - maxmemory_delta                 = 642 -> null
          - maxmemory_policy                = "volatile-lru" -> null
          - maxmemory_reserved              = 642 -> null
          - rdb_backup_enabled              = false -> null
          - rdb_backup_frequency            = 0 -> null
          - rdb_backup_max_snapshot_count   = 0 -> null
        }

      - timeouts {}
    }

  # module.redis-cache.azurerm_resource_group.cache-resourcegroup[0] will be destroyed
  # (because azurerm_resource_group.cache-resourcegroup is not in configuration)
  - resource "azurerm_resource_group" "cache-resourcegroup" {
      - id       = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/rpx-ao-redis-cache-aat" -> null
      - location = "uksouth" -> null
      - name     = "rpx-ao-redis-cache-aat" -> null
      - tags     = {
          - "BuiltFrom"           = "https://github.com/HMCTS/rpx-xui-approve-org.git"
          - "application"         = "expert-ui"
          - "businessArea"        = "CFT"
          - "changeUrl"           = ""
          - "contactSlackChannel" = "#xui-pipeline"
          - "environment"         = "staging"
          - "managedBy"           = "Expert UI"
        } -> null

      - timeouts {}
    }

  # module.redis6-cache.azurerm_private_endpoint.this[0] will be created
  + resource "azurerm_private_endpoint" "this" {
      + custom_dns_configs       = (known after apply)
      + id                       = (known after apply)
      + location                 = "uksouth"
      + name                     = "xui-aat"
      + network_interface        = (known after apply)
      + private_dns_zone_configs = (known after apply)
      + resource_group_name      = "xui-cache-aat"
      + subnet_id                = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/core-infra-aat/providers/Microsoft.Network/virtualNetworks/core-infra-vnet-aat/subnets/core-infra-subnet-2-aat"
      + tags                     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/rpx-xui-approve-org.git"
          + "application"         = "expert-ui"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#xui-pipeline"
          + "environment"         = "staging"
          + "managedBy"           = "Expert UI"
        }

      + private_dns_zone_group {
          + id                   = (known after apply)
          + name                 = "redis-endpoint-dnszonegroup"
          + private_dns_zone_ids = [
              + "/subscriptions/1baf5470-1c3e-40d3-a6f7-74bfbce4b348/resourceGroups/core-infra-intsvc-rg/providers/Microsoft.Network/privateDnsZones/privatelink.redis.cache.windows.net",
            ]
        }

      + private_service_connection {
          + is_manual_connection           = false
          + name                           = "xui-aat"
          + private_connection_resource_id = (known after apply)
          + private_ip_address             = (known after apply)
          + subresource_names              = [
              + "redisCache",
            ]
        }
    }

  # module.redis6-cache.azurerm_redis_cache.redis will be created
  + resource "azurerm_redis_cache" "redis" {
      + capacity                      = 1
      + enable_non_ssl_port           = false
      + family                        = "P"
      + hostname                      = (known after apply)
      + id                            = (known after apply)
      + location                      = "uksouth"
      + minimum_tls_version           = "1.2"
      + name                          = "xui-ao-webapp-aat"
      + port                          = (known after apply)
      + primary_access_key            = (sensitive value)
      + primary_connection_string     = (sensitive value)
      + private_static_ip_address     = (known after apply)
      + public_network_access_enabled = false
      + redis_version                 = "6"
      + replicas_per_master           = (known after apply)
      + replicas_per_primary          = (known after apply)
      + resource_group_name           = "xui-cache-aat"
      + secondary_access_key          = (sensitive value)
      + secondary_connection_string   = (sensitive value)
      + sku_name                      = "Premium"
      + ssl_port                      = (known after apply)
      + tags                          = {
          + "BuiltFrom"           = "https://github.com/HMCTS/rpx-xui-approve-org.git"
          + "application"         = "expert-ui"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#xui-pipeline"
          + "environment"         = "staging"
          + "managedBy"           = "Expert UI"
        }

      + redis_configuration {
          + enable_authentication           = true
          + maxclients                      = (known after apply)
          + maxfragmentationmemory_reserved = 642
          + maxmemory_delta                 = 642
          + maxmemory_policy                = "volatile-lru"
          + maxmemory_reserved              = 642
        }
    }

  # module.redis6-cache.azurerm_resource_group.cache-resourcegroup[0] will be created
  + resource "azurerm_resource_group" "cache-resourcegroup" {
      + id       = (known after apply)
      + location = "uksouth"
      + name     = "xui-cache-aat"
      + tags     = {
          + "BuiltFrom"           = "https://github.com/HMCTS/rpx-xui-approve-org.git"
          + "application"         = "expert-ui"
          + "businessArea"        = "CFT"
          + "changeUrl"           = ""
          + "contactSlackChannel" = "#xui-pipeline"
          + "environment"         = "staging"
          + "managedBy"           = "Expert UI"
        }
    }

Plan: 4 to add, 0 to change, 3 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":746,"Program":"tfcmt","SHA1":"","Vars":{}} -->